app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "English"], ["room_number", 1], ["created_at", "2021-03-07 22:11:37.598604"], ["updated_at", "2021-03-07 22:11:37.598604"]]